In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv("data.csv")

In [3]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [4]:
data["ocean_proximity"].value_counts()

ocean_proximity
<1H OCEAN     9136
INLAND        6551
NEAR OCEAN    2658
NEAR BAY      2290
ISLAND           5
Name: count, dtype: int64

In [5]:
from sklearn.preprocessing import LabelEncoder
data.ocean_proximity=LabelEncoder().fit_transform(data.ocean_proximity)

In [6]:
data["ocean_proximity"].value_counts()

ocean_proximity
0    9136
1    6551
4    2658
3    2290
2       5
Name: count, dtype: int64

In [7]:
data=data.drop(["longitude","latitude"],axis=1)

In [8]:
data.head()

,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,3
1,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,3
2,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,3
3,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,3
4,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,3

In [9]:
data["constant"]=pd.DataFrame(np.ones(len(data)))

In [10]:
data.head()

,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,constant
0,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,3,1.0
1,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,3,1.0
2,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,3,1.0
3,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,3,1.0
4,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,3,1.0

In [11]:
train=data[:int(0.7*len(data))]
test=data[int(0.7*len(data)):]

In [12]:
trainy=train["median_house_value"]
testy=test["median_house_value"]

In [13]:
trainx=train.drop(["median_house_value"],axis=1)
testx=test.drop(["median_house_value"],axis=1)

In [14]:
theta=np.zeros(8)

In [15]:
theta=pd.DataFrame(theta)

theta.head()

     0
0  0.0
1  0.0
2  0.0
3  0.0
4  0.0

In [16]:
trainx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14447 entries, 0 to 14446
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   housing_median_age  14447 non-null  float64
 1   total_rooms         14447 non-null  float64
 2   total_bedrooms      14309 non-null  float64
 3   population          14447 non-null  float64
 4   households          14447 non-null  float64
 5   median_income       14447 non-null  float64
 6   ocean_proximity     14447 non-null  int64
 7   constant            14447 non-null  float64
dtypes: float64(7), int64(1)
memory usage: 903.1 KB

In [17]:
testx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6193 entries, 14447 to 20639
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   housing_median_age  6193 non-null   float64
 1   total_rooms         6193 non-null   float64
 2   total_bedrooms      6124 non-null   float64
 3   population          6193 non-null   float64
 4   households          6193 non-null   float64
 5   median_income       6193 non-null   float64
 6   ocean_proximity     6193 non-null   int64
 7   constant            6193 non-null   float64
dtypes: float64(7), int64(1)
memory usage: 387.2 KB

In [18]:
trainx["total_bedrooms"]=trainx["total_bedrooms"].fillna(trainx["total_bedrooms"].median())
testx["total_bedrooms"]=testx["total_bedrooms"].fillna(trainx["total_bedrooms"].median())

In [19]:
trainx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14447 entries, 0 to 14446
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   housing_median_age  14447 non-null  float64
 1   total_rooms         14447 non-null  float64
 2   total_bedrooms      14447 non-null  float64
 3   population          14447 non-null  float64
 4   households          14447 non-null  float64
 5   median_income       14447 non-null  float64
 6   ocean_proximity     14447 non-null  int64
 7   constant            14447 non-null  float64
dtypes: float64(7), int64(1)
memory usage: 903.1 KB

In [20]:
testx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6193 entries, 14447 to 20639
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   housing_median_age  6193 non-null   float64
 1   total_rooms         6193 non-null   float64
 2   total_bedrooms      6193 non-null   float64
 3   population          6193 non-null   float64
 4   households          6193 non-null   float64
 5   median_income       6193 non-null   float64
 6   ocean_proximity     6193 non-null   int64
 7   constant            6193 non-null   float64
dtypes: float64(7), int64(1)
memory usage: 387.2 KB

In [21]:
trainy.head()

0    452600.0
1    358500.0
2    352100.0
3    341300.0
4    342200.0
Name: median_house_value, dtype: float64

In [22]:
testy.head()

14447    500001.0
14448    450000.0
14449    332400.0
14450    394400.0
14451    311900.0
Name: median_house_value, dtype: float64

In [23]:
trainx.head()

,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,ocean_proximity,constant
0,41.0,880.0,129.0,322.0,126.0,8.3252,3,1.0
1,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,3,1.0
2,52.0,1467.0,190.0,496.0,177.0,7.2574,3,1.0
3,52.0,1274.0,235.0,558.0,219.0,5.6431,3,1.0
4,52.0,1627.0,280.0,565.0,259.0,3.8462,3,1.0

In [24]:
theta.head()

     0
0  0.0
1  0.0
2  0.0
3  0.0
4  0.0

In [25]:
trainx.columns=[0,1,2,3,4,5,6,7]

In [26]:
trainy.head()

0    452600.0
1    358500.0
2    352100.0
3    341300.0
4    342200.0
Name: median_house_value, dtype: float64

In [27]:
testx.columns=[0,1,2,3,4,5,6,7]

In [28]:
testx.head()

          0       1      2      3      4       5  6    7
14447  35.0  1878.0  308.0  598.0  257.0  6.9553  4  1.0
14448  30.0  1446.0  385.0  650.0  344.0  3.7440  4  1.0
14449  33.0  1588.0  289.0  683.0  301.0  5.4103  4  1.0
14450  34.0  2420.0  391.0  917.0  392.0  6.5881  4  1.0
14451  39.0  1846.0  350.0  765.0  329.0  3.9187  4  1.0

In [29]:
trainx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14447 entries, 0 to 14446
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       14447 non-null  float64
 1   1       14447 non-null  float64
 2   2       14447 non-null  float64
 3   3       14447 non-null  float64
 4   4       14447 non-null  float64
 5   5       14447 non-null  float64
 6   6       14447 non-null  int64
 7   7       14447 non-null  float64
dtypes: float64(7), int64(1)
memory usage: 903.1 KB

In [30]:
for i in range(len(trainx)):
    for j in range(8):
        hx=0
        for k in range(8):
            hx=hx+trainx[k][i]*theta[0][k]
        theta[0][j]=theta[0][j]-(0.0001*(hx-trainy[i])*trainx[j][i])

/tmp/ipykernel_11532/1427487835.py:5: RuntimeWarning: overflow encountered in double_scalars
  hx=hx+trainx[k][i]*theta[0][k]
/tmp/ipykernel_11532/1427487835.py:5: RuntimeWarning: invalid value encountered in double_scalars
  hx=hx+trainx[k][i]*theta[0][k]

In [31]:
print(theta)

    0
0 NaN
1 NaN
2 NaN
3 NaN
4 NaN
5 NaN
6 NaN
7 NaN

In [32]:
ans=testx.dot(theta)

In [33]:
ans.head()

        0
14447 NaN
14448 NaN
14449 NaN
14450 NaN
14451 NaN